"""
Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

Пример:

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
"""

 #+1е-9 сдедано чтобы округление 2.5 было до 3х ане до 2х
test1 = [2, 3, 4, 5, 6]
result = [test1[i]*test1[-i-1] for i in range(round(len(test1)/2+1e-9))]
print(result)

test2 = [2, 3, 5, 6]
result = [test2[i]*test2[-i-1] for i in range(round(len(test2)/2+1e-9))]
print(result)

